app/controllers/sessions_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'roshan_devadiga+5@persistent.co.in' AND `users`.id <> 1) LIMIT 1
---
  def forgot_password
    if request.post?
      @user = User.find(:first, :conditions => ["email = ?", params[:user][:email] ])

UPDATE `users` SET `updated_at` = '2011-02-03 06:19:50', `crypted_password` = '29478caa880da25ee7f8a2471a7e48a30b02aa35' WHERE `id` = 3
---
  def change_password
    if request.post?
      email, password = params[:email], params[:password]
      confirmation = params[:password_confirmation]
      if email.blank?
        user = User.authenticate(current_user.email, params[:old_password])
      else
        user = User.authenticate(email, params[:old_password])
      end
      if user && check_password_and_confirmation(password, confirmation)
        user.update_attributes(:password => password, :password_confirmation => confirmation)