app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `company`, `city`, `created_at`, `activated_at`, `crypted_password`, `title`, `country`, `company_url`, `remember_token_expires_at`, `updated_at`, `deleted_at`, `activation_code`, `last_name`, `remember_token`, `province`, `first_name`, `email`, `industry`, `state`) VALUES('c6a14f24a7d851d8852c55e17134ce5f4188e178', 'Persistent', 'Pune', '2011-02-07 10:55:16', NULL, '87c408edf9476706a8a6a0df899d0eff699841a0', 'SE', 'Kenya', 'www.persistent.com', NULL, '2011-02-07 10:55:16', NULL, 'ee1f47cc88c08f471c4f4044314ef15a22ca7329', 'Devadiga', NULL, 'Maharastra', 'roshan', 'roshan_devadiga123@persistent.co.in', NULL, 'pending')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.register! if @user && @user.valid?
    success = @user && @user.valid?
    if success && @user.errors.empty?
      @user.save